#+PROPERTY: header-args:sql :tangle createdb.sql  :engine postgresql :results none

** Convenience views
#+begin_src sql
-- drop view if exists nmap.open cascade;
create or replace view nmap.open
as
select distinct ip, port, project
  from nmap.services S
left join nmap.xml X on X.id = S.fileid
where state=1 order by 1, 2;
#+end_src

#+begin_src sql
drop view if exists nmap.open_aggregate;
create view nmap.open_aggregate
as
select ip, string_agg(port::text, ','), project from nmap.open
group by ip, project;
#+end_src

#+RESULTS:
| ip                 | string_agg   |
|--------------------+--------------|
| 10.29.212.137/32   | 139,445,3389 |
| 192.168.208.30/32  | 21,443       |
| 192.168.173.40/32  | 21,443       |
| 172.16.51.121/32   | 443          |
| 172.16.7.120/32    | 21,443       |
| 192.168.204.90/32  | 443          |
| 192.168.177.181/32 | 443          |
| 10.91.6.13/32      | 139,445,3389 |
| 192.168.50.220/32  | 21,443       |
| 192.168.176.29/32  | 443          |
| 192.168.201.129/32 | 443          |
| 10.70.0.7/32       | 22,443       |
| 10.91.4.25/32      | 139,445,3389 |
| 172.16.7.226/32    | 443          |
| 192.168.146.176/32 | 21,443       |
| 192.168.204.161/32 | 21,443       |
| 172.16.42.28/32    | 443          |
| 172.16.53.3/32     | 443          |
| 192.168.118.22/32  | 443          |
| 10.91.4.55/32      | 139,445,3389 |
| 10.59.36.11/32     | 80,443       |
| 192.168.50.143/32  | 21,443       |
| 10.79.0.193/32     | 22           |
| 192.168.200.11/32  | 443          |
| 172.16.39.207/32   | 443          |
| 10.0.54.92/32      | 22,443       |
| 10.99.1.161/32     | 22           |
| 192.168.174.5/32   | 443          |
| 172.16.53.13/32    | 443          |
| 192.168.203.57/32  | 21,443       |
| 192.168.119.49/32  | 443          |
| 10.0.54.78/32      | 22,443       |
| 192.168.205.120/32 | 21,443       |
| 192.168.204.189/32 | 21,443       |
| 10.77.2.3/32       | 21,23        |
| 172.16.7.74/32     | 21,443       |
| 192.168.114.221/32 | 443          |
| 172.16.43.27/32    | 443          |
| 172.16.9.126/32    | 21,443       |
| 172.16.9.232/32    | 21,443       |

